---
kind: other
id: Properties.T:Autodesk.Revit.DB.PointNode
source: html/d526db07-510f-0fee-d4a6-ece382b02451.htm
---
# PointNode Properties

Specifies whether the .NET object represents a valid Revit entity.